# необходимые библиотеки
import requests


class JokeCreateTesting:
    def __init__(self):  # Создаем атрибуты экземпляра класса
    # 1) Адрес списка категорий (для выбора):
        self.categories_url = "https://api.chucknorris.io/jokes/categories"
    # 2) Адрес случайной шутки по выбранной категории без необходимого значения категории:
        self.joke_selected_by_category = "https://api.chucknorris.io/jokes/random?category="
    # 3) Переменная для выбранной категории:
        self.selected_category = ""
    # 4) Переменная для списка категорий, полученного с адреса списка категорий:
        self.categories = []

    def entering_user_choice(self):
        # Получаем список категорий для вывода на экран
        result = requests.get(self.categories_url)  # ответ на GET-запрос о категориях
        self.categories = result.json()  # список категорий из ответа
        print(f"Прочитайте список категорий шуток (получен с адреса {self.categories_url}):")
        # Из всего ответа сервера берем только значение категорий,
        # преобразуем в строку и выводим, убрав лишние символы:
        print(str(self.categories).strip("[]").replace("'", ""),".",sep="")
        self.selected_category = input(
            f'''Для ПОЗИТИВНОГО ТЕСТИРОВАНИЯ ведите существующую категорию шутки, выбрав из списка
или
Для НЕГАТИВНОГО ТЕСТИРОВАНИЯ введите несуществующую категорию (или произвольные символы).
и
НАЖМИТЕ [Enter] для завершения ввода: '''
        )

    def getting_the_joke(self):
        # Тестируем получение рандомной шутки выбранной категории
        # Добавим к неполному адресу выбранную категорию:
        current_url = f"{self.joke_selected_by_category}{self.selected_category}"
        result = requests.get(current_url)  # весь ответ сервера на GET-запрос
        print(f"GET-запрос отправлен по адресу: {current_url}\n","-"*40,sep="")
        # Выводим на экран статус-код из ответа сервера
        print("Cтатус код ответа:", result.status_code)

        if self.selected_category in self.categories:
        # ПОЗИТИВНЫЙ СЦЕНАРИЙ ТЕСТИРОВАНИЯ
            print("Выбран ПОЗИТИВНЫЙ СЦЕНАРИЙ тестирования")
            # Проверка на статус-код: (Проверка условия ФР == ОР)
            assert result.status_code == 200, "Провал, статус код НЕверен!"
            print("\033[32mУспех, статус код ответа сервера верен\033[0m")  # если ОР == ФР

            # Проверка на соответствие категории полученной шутки.
            # Из ответа в формате JSON получаем списком категории (категорию) по ключу categories
            fact_categories_list = result.json().get("categories", [])
            # Проверяем, есть ли выбранная категория в списке из полученных категорий
            assert (self.selected_category in fact_categories_list), \
                "Провал, фактическая категория полученной шутки НЕ соответствует ожидаемой"
            print(f'\033[32mУспех, фактическая категория полученной шутки '
                f'({str(fact_categories_list).strip("[]")}) '
                f'соответствует запрошенной(ожидаемой) ({self.selected_category})\033[0m')

            # Проверка наличия ненулевого текста шутки
            joke_body = result.json().get("value", "")  # текст шутки в поле value,
            # если такое поле в ответе есть, поэтому и "", если поле value отсутствует
            assert len(joke_body) > 0, "Провал, в шутке нет символов или шутка отсутствует"
            # Вывод шутки на экран наглядно сообщает о наличии текста шутки:
            # Вывод на печать самой шутки:
            print(f"\033[32mУспех, в шутке есть символы. Текст полученной шутки:\n\033[36m{joke_body}\033[0m\033[0m",sep='')

        else:
        # НЕГАТИВНЫЙ СЦЕНАРИЙ ТЕСТИРОВАНИЯ
            print("Выбран НЕГАТИВНЫЙ СЦЕНАРИЙ тестирования")
            # Проверка на статус-код: (Проверка условия ФР == ОР)
            assert result.status_code == 404, "Провал, статус код НЕверен!"
            print("\033[32mУспех, статус код ответа сервера верен\033[0m")  # если ОР == ФР

start = JokeCreateTesting()  # Создаём экземпляр класса
start.entering_user_choice()  # Получаем список категорий и выбираем одну категорию (рандомно)
start.getting_the_joke()  # Тестируем получение рандомной шутки выбранной категории